ZHANG-Qidi/esp32_freertos_ffb/components/ArduinoCore-avr-1.8.7/cores/arduino/Arduino_HAL.cpp
#include "Arduino_HAL.h"

#include <stdint.h>

#include "Arduino.h"
#include "Arduino_interface.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "driver/mcpwm_prelude.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/soc_caps.h"

void delayMicroseconds(unsigned int us) { esp_rom_delay_us(us); }

void delay(unsigned long ms) { vTaskDelay(pdMS_TO_TICKS(ms)); }

unsigned long millis(void) { return (unsigned long)esp_timer_get_time() / 1000; }

unsigned long micros(void) { return (unsigned long)esp_timer_get_time(); }

void digitalWrite(uint8_t pin, uint8_t val) { gpio_set_level((gpio_num_t)pin, val ? 1 : 0); }

void pinMode(uint8_t pin, uint8_t mode) {
    gpio_config_t cfg = {
        .pin_bit_mask = 1ULL << pin,
        .mode = GPIO_MODE_DISABLE,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    switch (mode) {
        case OUTPUT:
            cfg.mode = GPIO_MODE_OUTPUT;
            break;
        case INPUT:
            cfg.mode = GPIO_MODE_INPUT;
            break;
        case INPUT_PULLUP:
            cfg.mode = GPIO_MODE_INPUT;
            cfg.pull_up_en = GPIO_PULLUP_ENABLE;
            break;
        case INPUT_PULLDOWN:
            cfg.mode = GPIO_MODE_INPUT;
            cfg.pull_down_en = GPIO_PULLDOWN_ENABLE;
            break;
    }
    gpio_config(&cfg);
}

#define FOC_MCPWM_TIMER_RESOLUTION_HZ (40000000)
#define FOC_MCPWM_PERIOD (1000)

#if CONFIG_SOC_MCPWM_SUPPORTED

static mcpwm_cmpr_handle_t comparators[3];

static void analogWriteInitMcpwm(uint8_t pin_u, uint8_t pin_v, uint8_t pin_w) {
    mcpwm_timer_handle_t timer;
    mcpwm_timer_config_t timer_config = {};
    timer_config.clk_src = MCPWM_TIMER_CLK_SRC_DEFAULT;
    timer_config.group_id = 0;
    timer_config.resolution_hz = FOC_MCPWM_TIMER_RESOLUTION_HZ;
    timer_config.period_ticks = FOC_MCPWM_PERIOD;
    timer_config.count_mode = MCPWM_TIMER_COUNT_MODE_UP_DOWN;
    ESP_ERROR_CHECK(mcpwm_new_timer(&timer_config, &timer));

    mcpwm_oper_handle_t operators[3];
    mcpwm_operator_config_t operator_config = {};
    operator_config.group_id = 0;  // operator should be in the same group of the above timers
    for (int i = 0; i < 3; i++) {
        ESP_ERROR_CHECK(mcpwm_new_operator(&operator_config, &operators[i]));
        ESP_ERROR_CHECK(mcpwm_operator_connect_timer(operators[i], timer));
    }

    mcpwm_comparator_config_t compare_config = {};
    compare_config.flags.update_cmp_on_tez = true;
    for (int i = 0; i < 3; i++) {
        ESP_ERROR_CHECK(mcpwm_new_comparator(operators[i], &compare_config, &comparators[i]));
        ESP_ERROR_CHECK(mcpwm_comparator_set_compare_value(comparators[i], 0));
    }

    mcpwm_gen_handle_t generators[3];
    int gen_gpios[3];
    gen_gpios[pin_u % 3] = pin_u;
    gen_gpios[pin_v % 3] = pin_v;
    gen_gpios[pin_w % 3] = pin_w;
    mcpwm_generator_config_t gen_config = {};
    for (int i = 0; i < 3; i++) {
        gen_config.gen_gpio_num = gen_gpios[i];
        ESP_ERROR_CHECK(mcpwm_new_generator(operators[i], &gen_config, &generators[i]));
    }

    for (int i = 0; i < 3; i++) {
        ESP_ERROR_CHECK(mcpwm_generator_set_action_on_compare_event(generators[i], MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_UP, comparators[i], MCPWM_GEN_ACTION_LOW)));
        ESP_ERROR_CHECK(mcpwm_generator_set_action_on_compare_event(generators[i], MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_DOWN, comparators[i], MCPWM_GEN_ACTION_HIGH)));
    }

    ESP_ERROR_CHECK(mcpwm_timer_enable(timer));
    ESP_ERROR_CHECK(mcpwm_timer_start_stop(timer, MCPWM_TIMER_START_NO_STOP));
}

void analogWrite(uint8_t pin, int value) {
    if (value < 0) value = 0;
    if (value > 255) value = 255;
    uint8_t index = pin % 3;
    uint32_t level = value / 255.0f * (float)(FOC_MCPWM_PERIOD) / 2.0f;
    // Regular uvw data to (0 ~ (EXAMPLE_FOC_MCPWM_PERIOD/2))
    ESP_ERROR_CHECK(mcpwm_comparator_set_compare_value(comparators[index], level));
}

// function setting the high pwm frequency to the supplied pins
// - BLDC motor - 3PWM setting
// - hardware speciffic
// in generic case dont do anything
void _configure3PWM(long pwm_frequency, const int pinA, const int pinB, const int pinC) {
    (void)(pwm_frequency);
    analogWriteInitMcpwm(pinA, pinB, pinC);
}

#else

#define FOC_PWM_TIMER_FREQ_HZ (FOC_MCPWM_TIMER_RESOLUTION_HZ / FOC_MCPWM_PERIOD)

void analogWrite(uint8_t pin, int value) {
    if (value < 0) value = 0;
    if (value > 255) value = 255;
    uint8_t channel = pin % 8;
    ledc_set_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)channel, value);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)channel);
}

void analogWriteInit(uint8_t pin) {
    uint8_t channel = pin % 8;
    static bool ledc_initialized[8] = {0};
    if (!ledc_initialized[channel]) {
        ledc_timer_config_t timer = {};
        timer.speed_mode = LEDC_LOW_SPEED_MODE;
        timer.duty_resolution = LEDC_TIMER_8_BIT;
        timer.timer_num = LEDC_TIMER_0;
        timer.freq_hz = FOC_PWM_TIMER_FREQ_HZ;
        timer.clk_cfg = LEDC_AUTO_CLK;
        ESP_ERROR_CHECK(ledc_timer_config(&timer));

        ledc_channel_config_t ch = {};
        ch.speed_mode = LEDC_LOW_SPEED_MODE;
        ch.channel = (ledc_channel_t)channel;
        ch.timer_sel = LEDC_TIMER_0;
        ch.gpio_num = pin;
        ch.duty = 0;
        ch.hpoint = 0;
        ESP_ERROR_CHECK(ledc_channel_config(&ch));
        ledc_initialized[channel] = true;
    }
}

// function setting the high pwm frequency to the supplied pins
// - BLDC motor - 3PWM setting
// - hardware speciffic
// in generic case dont do anything
void _configure3PWM(long pwm_frequency, const int pinA, const int pinB, const int pinC) {
    (void)(pwm_frequency);
    analogWriteInit(pinA);
    analogWriteInit(pinB);
    analogWriteInit(pinC);
}
#endif

const static char *TAG = "EXAMPLE";

#if SOC_ADC_ATTEN_NUM <= 1
#define EXAMPLE_ADC_ATTEN ADC_ATTEN_DB_0
#else
#define EXAMPLE_ADC_ATTEN ADC_ATTEN_DB_12
#endif

#define EXAMPLE_ADC1_CHAN0 ADC_CHANNEL_3
#define EXAMPLE_ADC1_CHAN1 ADC_CHANNEL_4
#define EXAMPLE_ADC1_CHAN2 ADC_CHANNEL_5

static int adc_raw[3];
static bool example_adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle);
static void example_adc_calibration_deinit(adc_cali_handle_t handle);

static adc_oneshot_unit_handle_t adc1_handle;

void analogReference(uint8_t mode) {
    static adc_oneshot_unit_init_cfg_t init_config1;
    static bool do_calibration1_chan0;
    static bool do_calibration1_chan1;
    static bool do_calibration1_chan2;
    static adc_cali_handle_t adc1_cali_chan0_handle = NULL;
    static adc_cali_handle_t adc1_cali_chan1_handle = NULL;
    static adc_cali_handle_t adc1_cali_chan2_handle = NULL;
    if (!mode) {
        //-------------ADC1 Init---------------//
        init_config1.unit_id = ADC_UNIT_1;
        ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc1_handle));

        //-------------ADC1 Config---------------//
        adc_oneshot_chan_cfg_t config = {
            .atten = EXAMPLE_ADC_ATTEN,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, EXAMPLE_ADC1_CHAN0, &config));
        ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, EXAMPLE_ADC1_CHAN1, &config));
        ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, EXAMPLE_ADC1_CHAN2, &config));

        //-------------ADC1 Calibration Init---------------//
        do_calibration1_chan0 = example_adc_calibration_init(ADC_UNIT_1, EXAMPLE_ADC1_CHAN0, EXAMPLE_ADC_ATTEN, &adc1_cali_chan0_handle);
        do_calibration1_chan1 = example_adc_calibration_init(ADC_UNIT_1, EXAMPLE_ADC1_CHAN1, EXAMPLE_ADC_ATTEN, &adc1_cali_chan1_handle);
        do_calibration1_chan2 = example_adc_calibration_init(ADC_UNIT_1, EXAMPLE_ADC1_CHAN2, EXAMPLE_ADC_ATTEN, &adc1_cali_chan2_handle);
    } else {
        // Tear Down
        ESP_ERROR_CHECK(adc_oneshot_del_unit(adc1_handle));
        if (do_calibration1_chan0) {
            example_adc_calibration_deinit(adc1_cali_chan0_handle);
        }
        if (do_calibration1_chan1) {
            example_adc_calibration_deinit(adc1_cali_chan1_handle);
        }
        if (do_calibration1_chan2) {
            example_adc_calibration_deinit(adc1_cali_chan2_handle);
        }
    }
}

int analogRead(uint8_t pin) {
    ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle, EXAMPLE_ADC1_CHAN0, &adc_raw[0]));
    ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle, EXAMPLE_ADC1_CHAN1, &adc_raw[1]));
    ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle, EXAMPLE_ADC1_CHAN2, &adc_raw[2]));
    return adc_raw[pin % 3];
}

/*---------------------------------------------------------------
        ADC Calibration
---------------------------------------------------------------*/
static bool example_adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle) {
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif

    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

static void example_adc_calibration_deinit(adc_cali_handle_t handle) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(handle));

#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(handle));
#endif
}
